# Pandas

## Series

The first main data type we will learn about for pandas is the Series data type.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

In [2]:
import numpy as np
import pandas as pd

In [10]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
mydict = {'a':10, 'b':20, 'c':30}

In [11]:
pd.Series(data=my_data)
# default indices are 0, 1, 2...

0    10
1    20
2    30
dtype: int64

In [12]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

We can also pass data in form of a dictionary. This makes it easy to see that indices are labels for the values stored in the Series object.

In [16]:
series = pd.Series(mydict)
series

a    10
b    20
c    30
dtype: int64

In [22]:
# labels can be used to access data stored, along with normal array indices
series[1], series['c']

(20, 30)

## DataFrames

We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [24]:
from numpy.random import randn
np.random.seed(10)

In [60]:
df = pd.DataFrame(randn(5,5),index='A B C D E'.split(),columns='W X Y Z V'.split())

In [61]:
df

          W         X         Y         Z         V
A  0.660232 -0.350872 -0.939433 -0.489337 -0.804591
B -0.212698 -0.339140  0.312170  0.565153 -0.147420
C -0.025905  0.289094 -0.539879  0.708160  0.842225
D  0.203581  2.394704  0.917459 -0.112272 -0.362180
E -0.232182 -0.501729  1.128785 -0.697810 -0.081122

In [62]:
df2 = pd.DataFrame([['A', 'B'], ['C', 'D']], index='P Q'.split(), columns=(99, 100))
df2

  99  100
P   A   B
Q   C   D

### Selection and Indexing

We can use square brackets to select columns whose labels are in the list of labels passed in as parameters.

In [63]:
df['W']

A    0.660232
B   -0.212698
C   -0.025905
D    0.203581
E   -0.232182
Name: W, dtype: float64

In [64]:
df[['W','Y']] #list of columns

          W         Y
A  0.660232 -0.939433
B -0.212698  0.312170
C -0.025905 -0.539879
D  0.203581  0.917459
E -0.232182  1.128785

Each column in a DataFrame is a Series object

### Removing Columns

`df.drop(labels, axis, inplace)`  
- `axis` is 0 if the label corresponds to an index, it is 1 if the label is of a column.
- `inplace` if the row/column is to be dropped from the DataFrame, by default `False`, and thus returns a new DataFrame with the particular labelled rows/columns removed

In [65]:
df

          W         X         Y         Z         V
A  0.660232 -0.350872 -0.939433 -0.489337 -0.804591
B -0.212698 -0.339140  0.312170  0.565153 -0.147420
C -0.025905  0.289094 -0.539879  0.708160  0.842225
D  0.203581  2.394704  0.917459 -0.112272 -0.362180
E -0.232182 -0.501729  1.128785 -0.697810 -0.081122

In [66]:
df.drop('A')

          W         X         Y         Z         V
B -0.212698 -0.339140  0.312170  0.565153 -0.147420
C -0.025905  0.289094 -0.539879  0.708160  0.842225
D  0.203581  2.394704  0.917459 -0.112272 -0.362180
E -0.232182 -0.501729  1.128785 -0.697810 -0.081122

In [67]:
df.drop(['X', 'Z'], axis = 1)

          W         Y         V
A  0.660232 -0.939433 -0.804591
B -0.212698  0.312170 -0.147420
C -0.025905 -0.539879  0.842225
D  0.203581  0.917459 -0.362180
E -0.232182  1.128785 -0.081122

In [69]:
# Check for yourself if the original DataFrame is changed
# An inplace drop will remove the row/column from the DataFrame
df.drop('V', axis=1, inplace=True)

df

          W         X         Y         Z
A  0.660232 -0.350872 -0.939433 -0.489337
B -0.212698 -0.339140  0.312170  0.565153
C -0.025905  0.289094 -0.539879  0.708160
D  0.203581  2.394704  0.917459 -0.112272
E -0.232182 -0.501729  1.128785 -0.697810

### Selecting Rows

In [70]:
df.loc['A'], type(df.loc['A'])

(W    0.660232
 X   -0.350872
 Y   -0.939433
 Z   -0.489337
 Name: A, dtype: float64,
 pandas.core.series.Series)

Interestingly, the rows in a DataFrame, just like the columns are Series objects!
The indices of such Series objects would be the column labels, with the exact opposite in case of column Series.

In [71]:
df.loc['A', 'Y']

-0.9394333597625512

#### Selecting subset of rows and columns

The resulting DataFrame object is a part of the larger DataFrame.

In [72]:
sub = df.loc[['A','B'],['W','Y']]
print(type(sub))
sub

<class 'pandas.core.frame.DataFrame'>

          W         Y
A  0.660232 -0.939433
B -0.212698  0.312170

## Conditional Selection

In [73]:
df

          W         X         Y         Z
A  0.660232 -0.350872 -0.939433 -0.489337
B -0.212698 -0.339140  0.312170  0.565153
C -0.025905  0.289094 -0.539879  0.708160
D  0.203581  2.394704  0.917459 -0.112272
E -0.232182 -0.501729  1.128785 -0.697810

Just like in Numpy, a conditional statement returns a boolean DataFrame - corresponding to each element is a `True` or `False`, depending on the output of the condition on the element. Each element in the DataFrame is compared to 0.

In [78]:
df > 0

       W      X      Y      Z
A   True  False  False  False
B  False  False   True   True
C  False   True  False   True
D   True   True   True  False
E  False  False   True  False

For conditions involving Series, eg a particular column, behaviour is like numpy arrays - a boolean Series whose value corresponding to each element is the condition applied to that element. Each value in the `W` labelled column is compared against 0.

In [80]:
bool_arr = df['W'] > 0
bool_arr

A     True
B    False
C    False
D     True
E    False
Name: W, dtype: bool

In [81]:
df[df['W'] > 0]

          W         X         Y         Z
A  0.660232 -0.350872 -0.939433 -0.489337
D  0.203581  2.394704  0.917459 -0.112272

Only those indices are kept for which the value of the boolean array is `True`, the rest are filtered out.

In [83]:
df[df['W'] > 0][['W', 'Z']] # using conditional filters, then selecting columns W and Z using []

          W         Z
A  0.660232 -0.489337
D  0.203581 -0.112272

### Multiple Conditions

Can use `|` (`OR`) and `&` (`AND`) to combine conditions

In [86]:
# the rows (and corresponding) indices of the DataFrame for which column W > 0 and column X < 1
df[(df['W']>0) & (df['X'] < 1)]

          W         X         Y         Z
A  0.660232 -0.350872 -0.939433 -0.489337

In [88]:
df['States'] = 'GJ MH UP TN MZ'.split()
df

          W         X         Y         Z States
A  0.660232 -0.350872 -0.939433 -0.489337     GJ
B -0.212698 -0.339140  0.312170  0.565153     MH
C -0.025905  0.289094 -0.539879  0.708160     UP
D  0.203581  2.394704  0.917459 -0.112272     TN
E -0.232182 -0.501729  1.128785 -0.697810     MZ

Sets the elements in the column with label 'States' as the indices of the DataFrame, not inplace by default.

In [90]:
df.set_index('States')

               W         X         Y         Z
States
GJ      0.660232 -0.350872 -0.939433 -0.489337
MH     -0.212698 -0.339140  0.312170  0.565153
UP     -0.025905  0.289094 -0.539879  0.708160
TN      0.203581  2.394704  0.917459 -0.112272
MZ     -0.232182 -0.501729  1.128785 -0.697810

## Handling Missing Data

In [91]:
df = pd.DataFrame({ 'A':[1,2,np.nan],
                    'B':[5,np.nan,np.nan],
                    'C':[1,2,3] })

In [93]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

`df.dropna(axis, how, thresh)`  
- `axis` specifies whether to drop rows or columns with NaN (missing) values
- `how`  specifies whether to drop rows/columns with atleast one NaN or only those with all NaN entries
- `thresh` the number of non NA values required to not be dropped

In [99]:
df.dropna()

     A    B  C
0  1.0  5.0  1

# Data Input and Output

Pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:


### CSV Input

In [100]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15